{
  "basics": {
    "name": "Max Kim",
    "image": "",
    "email": "mkhyeon7@gmail.com",
    "url": "https://www.linkedin.com/in/khyeon/"
  },
  "work": [
    {
      "name": "Applied Control Engineering, Inc.",
      "position": "Control Engineer",
      "location": "Baltimore, MD",
      "startDate": "2025-01",
      "endDate": "",
      "highlights": [
        "Develop and integrate control and automation software for industrial systems, emphasizing reliability, safety, and deterministic behavior",
        "Debug and deploy PLC-based control systems communicating over Ethernet/IP and Modbus TCP in live industrial environments",
        "Led delivery of a $134K+ industrial controls project after teammate departure, assuming sole responsibility for both PLC (control logic) and HMI (operator interface) development; successfully implemented, tested, and deployed a fully integrated system meeting all customer requirements"
      ]
    },
    {
      "name": "Laboratory for Control and Information Systems",
      "position": "Research Assistant",
      "location": "College Park, MD",
      "url": "https://enme.umd.edu/research/laboratory-control-and-information-systems",
      "startDate": "2022-04",
      "endDate": "2024-12",
      "summary": "",
      "highlights": [
        "Designed and implemented control-oriented digital twin models for abdominal aortic aneurysm (AAA) assessment using MATLAB and Python, supporting simulation, estimation, and system validation",
        "Curated and processed a 600+ patient dataset, filtering to N<80 matched cohorts based on comorbidities, physical factors, and signal quality; validated model performance achieving 50%-68% sensitivity at 75% specificity (comparable to trained experts)",
        "First author on 1 peer-reviewed publication and co-author on 1 additional manuscript in progress, demonstrating end-to-end ownership of model development, validation, and quantitative analysis"
      ]
    }
  ],
  "education": [
    {
      "institution": "University of Maryland - College Park",
      "location": "College Park, MD",
      "studyType": "M.S. in Mechanical Engineering",
      "startDate": "2023-08-29",
      "endDate": "2024-12-20",
      "courses": [
        "GPA 3.77/4.0",
        "Advanced Systems Control", 
        "Applied Machine Learning", 
        "Decision Making Under Uncertainty", 
        "Optimal Estimation of Dynamic Systems"
      ]
    },
    {
      "institution": "University of Maryland - College Park",
      "location": "College Park, MD",
      "studyType": "B.S. in Mechanical Engineering",
      "startDate": "2019-08-29",
      "endDate": "2023-05-23",
      "courses": [
        "GPA 3.70/4.0",
        "Dean's list all semesters",
        "Clark Legacy scholarship recipient"
      ]
    }
  ],
  "skills": [
    {
      "name": "Programming",
      "icon": "fa-solid fa-laptop",
      "keywords": [
       "C and C++",
       "Python", 
       "MATLAB/Simulink", 
       "TypeScript"
      ]
    },
    {
      "name": "Systems",
      "icon": "fa-solid fa-gears",
      "keywords": [
        "Linux", 
        "Embedded Systems",
        "Real-Time Control", 
        "State Estimation", 
        "Sensor Fusion"
      ]
    },
    {
      "name": "Tools",
      "icon": "fa-solid fa-screwdriver-wrench",
      "keywords": [
        "Git", 
        "CMake", 
        "Docker", 
        "Bash", 
        "Microcontrollers"
      ]
    }
  ],
  "publications": [
    {
      "name": "Transmission Line Model as a Digital Twin for Abdominal Aortic Aneurysm Patients",
      "publisher": "npj Digital Medicine",
      "releaseDate": "2024-10-25",
      "url": "https://doi.org/10.1038/s41746-024-01303-5",
      "summary": "We investigated the potential of the transmission line model as a digital twin of aneurysmal aorta by comparatively analyzing how a uniform lossless tube-load model were fitted to the carotid and femoral artery tonometry waveforms from abdominal aortic aneurysm patients vs. their matched controls."
    },
    {
      "name": "Tube-Load Model as a Digital Twin for Abdominal Aortic Aneurysm Patients (poster)",
      "publisher": "IEEE International Engineering in Medicine and Biology Society Conference",
      "releaseDate": "2024-07-18",
      "url": "https://github.com/khyeonn/khyeonn.github.io/blob/main/assets/pdf/AAA-DK-EMBC2024.pdf",
      "summary": "To investigate the feasibility of tube-load models as a digital twin to detect and monitor abdominal aortic aneurysms, helping to improve accessibility to screening and surveillance."
    },
    {
      "name": "Tube-Load Modeling of Aorta with Abdominal Aortic Aneurysm (poster)",
      "publisher": "IEEE International Conference on Biomedical and Health Informatics",
      "releaseDate": "2023-10-17",
      "url": "https://github.com/khyeonn/khyeonn.github.io/blob/main/assets/pdf/AAA-DK-BHI2023.pdf",
      "summary": "To investigate the feasibility of tube-load models in tracking the progression of abdominal aortic aneurysm in a patient pre- and post-endovascular repair surgery."
    }
  ],
  "projects": [
    {
      "name": "Custom UAV Flight Software",
      "highlights": [
        "Developing a fully custom UAV using off-the-shelf hardware and a custom flight control stack on RP2040 (Pi Pico 2)",
        "Implemented a multiplicative extended Kalman filter (MEKF) fusing 9-axis IMU data (accelerometer, gyroscope, magnetometer) for real-time attitude estimation",
        "Integrated embedded software with onboard sensors using UART and I2C, addressing timing, synchronization, and noise-related issues",
        "Ongoing work focused on embedded real-time control, sensor fusion, and flight-critical software reliability"
      ],
      "startDate": "2025-08",
      "endDate": ""
    },
    {
      "name": "Auto Repair Shop Queue Management System",
      "highlights": [
        "Built and deployed a production software system for local auto repair shop supporting 480+ jobs and $98,000+ revenue in the first 2 months, managing 20+ customers daily",
        "Increased daily service throughput from ~10 vehicles/day to 20+ vehicles/day by redesigning job intake, invoicing, and workflow visibility (owner-estimated)", 
        "Executed daily live deployments while the shop remained operational using CI/CD with rollback capability; manually tested core workflows for hours on real and dummy jobs to prevent downtime, resolving a major outage overnight to ensure uninterrupted next-day operations "
      ],
      "startDate": "2025-10",
      "endDate": ""
    },
    {
      "name": "UAV Navigation Using Reinforcement Learning",
      "highlights": [
        "Built a custom drone simulation environment with stochastic linear dynamics in continuous state and action space featuring 10 randomized obstacles.", 
        "Designed a navigation algorithm that could outperform a heuristic-based control algorithm in unseen environments by 27% in terms of time-steps taken."
      ],
      "startDate": "2024-03",
      "endDate": "2024-05"
    },
    {
      "name": "Robust PID Control of Automatic Blood Pressure Cuff",
      "highlights": [
        "Performed system identification on known pressure cuff and PWM solenoid valve models to approximate a transfer function of the system.", 
        "Designed a PID controller following ITAE and IMC principles to achieve 0 steady-state error.",
        "Validated robustness by simulating system response to changes in physical constraints."
      ],
      "startDate": "2023-11",
      "endDate": "2023-12"
    },
    {
      "name": "Assistive Utensil for Essential Tremor Patients",
      "highlights": [
        "Spearheaded the development of an assistive spoon for patients with essential tremors that could reduce tremors by up to 50%.", 
        "Engineered an affordable solution priced at $40, ensuring accessibility for a wide range of patients.",
        "Created comprehensive test beds and protocols to facilitate weekly testing during prototyping.",
        "Served as technical expert, developing all mathematical models for the project, and acted as a key reference resource for team members by providing technical guidance and support."
      ],
      "startDate": "2023-01",
      "endDate": "2023-05"
    }
  ]
}
